{"title": "Flake-Coons alliance offers respite from partisan rancor over Kavanaugh", "author": "Jon Ward", "publish_date": "2018-09-28", "img_src": "https://s.yimg.com/uu/api/res/1.2/yZIoJqrUlv68nhcgWMLGdw--~B/aD0xNDMyO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/d0392fb3a275607f3e5701824132f180", "text": "WASHINGTON — When Sen. Jeff Flake, R-Ariz., walked across the dais and tapped Sen. Chris Coons, D-Del., on the shoulder Friday morning, it was the product of more than a collegial relationship.\n\nThe two lawmakers, whose political views are often at odds with the other’s, are known to be friends. Their across-the-aisle bond has been formed in part by traveling together to foreign countries on Senate working trips, known as codels, for congressional delegations.\n\nBut Flake and Coons also share an abiding love for the Senate as an institution, for preserving processes by which competing political parties with different points of view can reach agreements that both sides respect. It’s a concern for nothing less than the stability of American democracy.\n\n“Senator Flake is a genuine conservative. He’s written a book about the conscience of a conservative. He and I do not share a lot of political views,” Coons told reporters Friday, just moments after Flake announced to the Senate Judiciary Committee that he would agree to advance the Supreme Court nomination of Judge Brett Kavanaugh to a vote in the full Senate on the condition that the final vote be delayed no longer than a week to allow an FBI investigation of a sexual assault allegation by Christine Blasey Ford.\n\n“But we share a deep concern … for the health of this institution and what it means to the rest of the world and to our country if we are unable to conduct ourselves respectfully and in a way that hears each other.”\n\nCoons specifically cited his foreign travel with Flake as a catalyst for how the two lawmakers have come to know one another and to understand their quite different perspectives.\n\n“I know how passionately he feels that our division right now teaches the wrong thing to the world about our democracy and suggests that we are not able to respect each other or work together,” Coons said.\n\nSen. Jeff lake was surrounded by reporters after calling for an FBI investigation of allegations against Supreme Court nominee Brett Kavanaugh. (Photo: Jacquelyn Martin/AP) More\n\nAnd so when Flake, who is retiring from the Senate after this year, wanted to discuss a way forward, it was Coons he sought out in the moments leading up to the Judiciary Committee vote. Up until that moment, Kavanaugh’s nomination seemed to be gathering momentum toward confirmation, a dynamic that wasn’t lost on Coons.\n\n“I frankly think that what Senator Flake is trying to do is achieve a brief, credible investigation of allegations in front of us and serve as a role model, as he has for me today, of someone who is willing to take a real political risk and upset many in his party by asking for a pause so that the American people can hear that we are able to work together on some things, that even though he and I are from different parties and have different values and different backgrounds, we respect each other and can work together,” Coons said.\n\nKavanaugh, of course, may very well still be confirmed. But Flake and Coons’s agreement has provided a release valve for the tension that had been building in the U.S. Capitol this week and had reached a fever pitch during the daylong hearing on Thursday in which Ford and then Kavanaugh both testified.\n\nFord’s emotional retelling of a sexual assault 35 years ago by a fellow high schooler she said was Kavanaugh was followed by an angry denial from Kavanaugh, who also railed against Democrats on the committee.\n\nThe Thursday hearing was a spectacle that left lawmakers and activists on both sides angry and exhausted, setting the stage for a potentially vicious few days leading up to a final Senate vote on the nomination on Tuesday.\n\nBut before the Judiciary Committee voted to advance Kavanaugh’s nomination to the full Senate, perhaps searing the acrimony of the moment into the pages of history, Flake had one last card to play. He and Coons disappeared into an antechamber off the floor of the hearing room as the minutes ticked down to the committee vote and as other senators delivered speeches. The two senators hashed out the compromise: Flake would insist that Republicans delay a vote, and Coons would agree that Democrats support a pause that was no longer than a week, to reassure Republicans who believed the requests for more investigation were simply a tactic intended to kill the nomination and not to seek the truth about Ford’s allegations."}