{"title": "Opinion: Christine Blasey Ford's Moving Testimony", "author": "Scott Simon", "publish_date": "2018-09-29", "img_src": "https://media.npr.org/assets/img/2018/09/28/gettyimages-1041759696_wide-40882d0997aeeae202ea38cf854b72f4563a9150.jpg?s=1400", "text": "Opinion: Christine Blasey Ford's Moving Testimony\n\nEnlarge this image toggle caption Erin Schaff/Getty Images Erin Schaff/Getty Images\n\nI think a lot of people might have felt a jolt in their souls when Christine Blasey Ford told the Senate Judiciary Committee that one of the most vivid, indelible memories she has of the night she says she was sexually assaulted at 15 by a 17-year-old Brett Kavanaugh behind a closed door, while his friend looked on, was what she recalled as \"the uproarious laughter between the two, and their having fun at my expense.\"\n\nJudge Kavanaugh denies the allegations.\n\nIt is hard not to be chilled and sickened to hear a woman recall how she heard cruel laughter from two older boys, as they stumbled drunk back to the party, after they had pinned her to a bed and tried to strip off her clothes, sexually assault her, and made her fear for her life by clapping a hand over her mouth to stop her screams. It was a story of cold, brute male force, followed by uncaring laughter. Demeaning and dismissive laughter that, in a way, is its own kind of assault.\n\nMany women have heard that kind of laughter.\n\nIt is always a little precarious when a specific human story with many moving parts becomes a social or political symbol. Ford's moving testimony unlocked a heavy door in America this week. Her pointed, painful memories helped inspire many women to unearth their own, often for the first time, to talk about the times they have been assaulted, pawed, groped, humiliated or raped. These are stories many women have locked away, just to keep going. They need to be heard now, both out in the open, and in the privacy of families.\n\nAll of those stories from so many women don't necessarily prove that 17-year-old Brett Kavanaugh attacked 15-year-old Christine Blasey Ford in the summer of 1982. Just as middle-aged Kavanaugh's record of promoting women, or coaching a girl's basketball team, doesn't prove that he didn't.\n\nThat door Ford and so many other women have opened, often at great personal cost, could throw more light onto the darkness of sexual assault. But will the events of this week encourage more women and men to trust they will be heard if they have the courage to come forward? Or do they have to fear they will be met with disbelief, indifference, and even the cold, derisive laughter that Christine Blasey Ford made so many remember?"}