{"title": "FBI contacts 2nd Kavanaugh accuser; Trump says extra scrutiny may be 'blessing in disguise'", "author": "Adam Shaw", "publish_date": "2018-09-29", "img_src": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2018/09/29/0/0/694940094001_5842180131001_5842186525001-vs.jpg?ve=1", "text": "The FBI has reached out to a second woman who has accused Supreme Court nominee Brett Kavanaugh of sexual assault -- a day after President Trump ordered the bureau to conduct a new background investigation.\n\nAn attorney for Deborah Ramirez, who claims that Kavanaugh exposed himself to her at a Yale college party several years ago, said that the FBI had reached out to her.\n\n\"We can confirm the FBI has reached out to interview Ms. Ramirez and she has agreed to cooperate with their investigation,\" attorney John Clune said in a statement. \"Out of respect for the integrity of the process, we will have no further comment at this time.\"\n\nThe development was first reported by The Washington Post.\n\nThe FBI background check comes after Sen. Jeff Flake, R-Ariz., joined Democrats on Friday in calling for the investigation into sexual assault allegations made against Kavanaugh.\n\nKavanaugh has repeatedly denied all accusations against him.\n\nFLAKE DEFENDS CALL FOR KAVANAUGH DELAY: 'WE'RE COMING APART AT THE SEAMS'\n\nOn Thursday Kavanaugh testified to a Senate Judiciary Committee hearing after Christine Blasey Ford testified that he had assaulted her at a high school party in 1982. In a blistering response, he called the circumstances surrounding his nomination a \"circus.\"\n\nOn Friday, the committee voted to recommend Kavanaugh to the Senate for confirmation to the high court post, but Flake requested the “limited” weeklong background check. With Republicans holding a very slim majority in the Senate, Trump ordered the investigation despite GOP leaders having previously argued there was no need for further investigation.\n\nThe inquiry is expected to wrap by Friday.\n\nIn a letter to FBI Director Christopher Wray on Saturday, Sen. Orrin Hatch, R-Utah, requested that the bureau notify the White House Counsel's Office immediately if any witnesses attempt to in any way delay the investigation or decline to cooperate.\n\nOne key reason for his concern, wrote Hatch, a mmber and former chairman of the Senate Judicary Committee, \"comes from testimony during the hearing this past Thursday. According to Dr. Ford, she would have preferred to have been interviewed in California, away from the spectacle of a public hearing. But her lawyers apparently refused to convey to their client numerous offers by Senate Judiciary Committee Chairman Chuck Grassley to conduct a public or private interview in a location of her choosing. The lawyers’ refusal led directly to a public hearing, against Dr. Ford’s express wishes. This is deeply troubling.\"\n\n\n\nRepublicans have accused Democrats of trying to delay the vote until after the midterms, when Democrats are hoping to have retaken control of the Senate. Democrats, in turn, have assailed what they say has been a rush toward confirmation regardless of the allegations against the judge.\n\nOn Friday Flake defended his decision to press for the further inquiry, saying he wanted to protect the credibility of America’s institutions.\n\n“Two institutions, really,” he told The Atlantic. “One, the Supreme Court is the lone institution where most Americans still have some faith. And then the U.S. Senate as an institution — we’re coming apart at the seams. There’s no currency, no market for reaching across the aisle. It just makes it so difficult.”\n\nHowever, he also said that the delay could eventually help both Republicans, and Kavanaugh himself.\n\n“Obviously. I’ve felt that this delay is as much to help him as us. My hope is that some Democrats will say, “Hey, we may not change our vote, but this process was worthy of the institution, and we feel satisfied.”\n\n\"That means something,” he said. “The country needs to hear that.”\n\nA third woman has also leveled charges against Kavanaugh. As was the case with Ford and Ramirez, she said the events occurred decades ago.\n\nIn a sworn declaration, Julie Swetnick of Washington, D.C., said she witnessed him \"consistently engage in excessive drinking and inappropriate contact of a sexual nature with women in the early 1980s\" and that Kavanaugh was involved in \"gang\" rapes of girls at parties.\n\nAs with the other cases, the judge has maintained his innocence.\n\nFox News' Mike Emanuel contributed to this report."}